/* 
   Localizable.strings
   TouchsmartTUIO

   Created by Georg Kaindl on 25/2/09.
   Copyright 2009 Georg Kaindl. All rights reserved.
 */

"OK" = "OK";
"Alright" = "Alright";

"VersionWithNumber" =	"Version %@";

"SetupTUIOTargetError" = "Error while setting up TUIO/OSC distributor.";
"SetupTUIOTargetErrorDesc" = "There was an error setting up TUIO/OSC sending to %@:%u (UDP). This might be due to malformed address data.\n\nPlease change the OSC sender settings in the Preferences. No OSC data will be sent until you have specified an endpoint that works.";

"SetupFlashXMLSocketError" = "Error while setting up TUIO/Flash XML-Socket distributor.";
"SetupFlashXMLSocketErrorDesc" = "There was an error setting up the TUIO/Flash XML-Socket server on TCP port %u. This might be because the port is already taken by another application or privileged.\n\nPlease change the port in the Preferences. Flash clients will not be able to connect until you have specified a port that can be used.";

"SenderNameLabel"				= "Device";
"SenderSerialNumberLabel"		= "Serial Number";
"SenderFirmwareVersionLabel"	= "Firmware Rev.";
"SenderModel"					= "Model";
"SenderProductID"				= "Product ID";

"NoDevice"						= "No Device";
"N/A"							= "N/A";

"NextwindowCompatibleDevice"	= "Nextwindow API compatible";

/* for Touché */

"TFTUIOXMLFlashServerAnyAddressName" = "any";
"TFTUIOXMLFlashServerListenSocketErrorDescription" = "A TUIO/Flash XML-Socket server could not be instantiated at the TCP endpoint %@:%u.\n\nMost likely, this is because another process is already listening on this port or because this port is privileged, but you are not. (ports up to 1024 are privileged).";

"TFTUIOAddClientInvalidHost"		= "Host name could not be resolved.";
"TFTUIOAddClientInvalidPort"		= "Port must be between 1 and 65535.";
"TFTUIOAddClientAlreadyExists"		= "This client is already being served.";